import jieba


标签名 = '+我是一个好人'
标签名 = list(jieba.cut(标签名))
# 删除长度为1的内容


匹配系统开启状态 = {'单字匹配': False}
匹配系统运行状态 = {'单字匹配': False}
# 处理传入的数据
for a in 标签名:
    #################################################
    # 语法检测
    if a != '+' and len(a) <= 1 or 匹配系统运行状态['单字匹配']:
        标签名.remove(a)
    else:
        if 匹配系统运行状态['单字匹配']:
            pass;
        else:
            匹配系统开启状态['单字匹配'] = True
            匹配系统运行状态['单字匹配'] = True
            continue

    #################################################
    # 运行状态检测
    # 如果 单字匹配 处于开启状态就关闭他，否则不管
    if 匹配系统运行状态['单字匹配']: 匹配系统运行状态['单字匹配'] = False

print(标签名)